<template>
  <div>
    <div class="search_light">
      <input
        v-model="search_text"
        @keydown.enter="nextMatch()"
        @input="findMatches()"
      />
      <span v-if="matches.length > 0">
        {{ current_item }}/{{ matches.length }}
      </span>
      <button @click="prevMatch()">
        <
      </button>
      <button @click="nextMatch()">
        >
      </button>
    </div>
    <ul ref="container_scroll" class="container_scroll">
      <item-elem
        v-for="(item, index) in options"
        :key="index"
        :text="searchLightText(item)"
      ></item-elem>
    </ul>
  </div>
</template>
<script>
import itemElem from "./item-elem.vue";
export default {
  components: {
    itemElem,
  },
  data() {
    return {
      search_text: "",
      current_item: 0,
      matches: [],
      options: [
        "first text",
        "second text",
        "simple text",
        "foo example",
        "bar example",
        "python is awesome",
        "Таким образом постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки модели развития. ",
        "Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки новых предложений.",
        "Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки систем массового участия.",
        "Разнообразный и богатый опыт начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки системы обучения кадров, соответствует насущным потребностям.",
        "Не следует, однако забывать, что начало повседневной работы по формированию позиции способствует подготовки и реализации форм развития.",
        "Таким образом постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки модели развития. ",
        "Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки новых предложений.",
        "Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки систем массового участия.",
        "Разнообразный и богатый опыт начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки системы обучения кадров, соответствует насущным потребностям.",
        "Не следует, однако забывать, что начало повседневной работы по формированию позиции способствует подготовки и реализации форм развития.",
        "Таким образом постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки модели развития. ",
        "Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки новых предложений.",
        "Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки систем массового участия.",
        "Разнообразный и богатый опыт начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки системы обучения кадров, соответствует насущным потребностям.",
        "Не следует, однако забывать, что начало повседневной работы по формированию позиции способствует подготовки и реализации форм развития.",
        "Таким образом постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки модели развития. ",
        "Равным образом постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки новых предложений.",
        "Повседневная практика показывает, что постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки систем массового участия.",
        "Разнообразный и богатый опыт начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки системы обучения кадров, соответствует насущным потребностям.",
        "Не следует, однако забывать, что начало повседневной работы по формированию позиции способствует подготовки и реализации форм развития.",
      ],
    };
  },
  methods: {
    searchLightText(text) {
      return this.search_text.length > 0
        ? text.replace(
            new RegExp(this.search_text, "ig"),
            "<span class='light-text'>$&</span>"
          )
        : text;
    },
    findMatches() {
      this.$nextTick(() => {
        this.matches = this.$el.querySelectorAll(".light-text");
        this.current_item = 1;
      });
    },
    nextMatch() {
      if (this.matches.length == 0) return;
      this.current_item = (this.current_item % this.matches.length) + 1;
      this.scrollToMatch();
    },
    prevMatch() {
      if (this.matches.length == 0) return;
      this.current_item =
        this.current_item == 1 ? this.matches.length : this.current_item - 1;
      this.scrollToMatch();
    },
    scrollToMatch() {
      let elem = this.matches[this.current_item - 1].offsetTop;
      window.scroll(0, elem);
    },
  },
};
</script>
<style lang="scss">
.light-text {
  color: red;
  background: yellow;
}
.search_light {
  position: fixed;
  right: 50px;
  top: 50px;
}
.container_scroll {
  width: 400px;
  li {
    min-height: 50px;
    margin-bottom: 10px;
  }
}
</style>
